knieriem/tinygo-stm32-svd/svd/stm32u595.svd
        <register>
          <name>PATT</name>
          <displayName>PATT</displayName>
          <description>The FMC_PATT read/write register contains
          the timing information for NAND Flash memory bank. It is
          used for 8-bit accesses to the attribute memory space of
          the NAND Flash for the last address write access if the
          timing must differ from that of previous accesses (for
          Ready/Busy management, refer to Section20.8.5: NAND Flash
          prewait feature).</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFCFCFCFC</resetValue>
          <fields>
            <field>
              <name>ATTSET</name>
              <description>Attribute memory setup time These bits
              define the number of KCK_FMC (+1) clock cycles to set
              up address before the command assertion (NWE, NOE),
              for NAND Flash read or write access to attribute
              memory space:</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>254</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ATTWAIT</name>
              <description>Attribute memory wait time These bits
              define the minimum number of x KCK_FMC (+1) clock
              cycles to assert the command (NWE, NOE), for NAND
              Flash read or write access to attribute memory space.
              The duration for command assertion is extended if the
              wait signal (NWAIT) is active (low) at the end of the
              programmed value of KCK_FMC:</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>1</minimum>
                  <maximum>254</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ATTHOLD</name>
              <description>Attribute memory hold time These bits
              define the number of KCK_FMC clock cycles during
              which the address is held (and data for write access)
              after the command de-assertion (NWE, NOE), for NAND
              Flash read or write access to attribute memory
              space:</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>1</minimum>
                  <maximum>254</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ATTHIZ</name>
              <description>Attribute memory data bus Hi-Z time
              These bits define the number of KCK_FMC clock cycles
              during which the data bus is kept in Hi-Z after the
              start of a NAND Flash write access to attribute
              memory space on socket. Only valid for writ
              transaction:</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>254</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ECCR</name>
          <displayName>ECCR</displayName>
          <description>This register contain the current error
          correction code value computed by the ECC computation
          modules of the FMC NAND controller. When the CPU
          reads/writes the data from a NAND Flash memory page at
          the correct address (refer to Section20.8.6: Computation
          of the error correction code (ECC) in NAND Flash memory),
          the data read/written from/to the NAND Flash memory are
          processed automatically by the ECC computation module.
          When X bytes have been read (according to the ECCPS field
          in the FMC_PCR registers), the CPU must read the computed
          ECC value from the FMC_ECC registers. It then verifies if
          these computed parity data are the same as the parity
          value recorded in the spare area, to determine whether a
          page is valid, and, to correct it otherwise. The FMC_ECCR
          register should be cleared after being read by setting
          the ECCEN bit to 0. To compute a new data block, the
          ECCEN bit must be set to 1.</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ECC</name>
              <description>ECC result This field contains the value
              computed by the ECC computation logic. Table167
              describes the contents of these bit
              fields.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="FMC">
      <name>SEC_FMC</name>
      <baseAddress>0x520D0400</baseAddress>
    </peripheral>
    <peripheral>
      <name>GPDMA1</name>
      <description>GPDMA1</description>
      <groupName>GPDMA</groupName>
      <baseAddress>0x40020000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPDMA1_CH0</name>
        <description>GPDMA1 channel 0 global interrupt</description>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>GPDMA1_CH1</name>
        <description>GPDMA1 channel 1 global interrupt</description>
        <value>30</value>
      </interrupt>
      <interrupt>
        <name>GPDMA1_CH2</name>
        <description>GPDMA1 channel 2 global interrupt</description>
        <value>31</value>
      </interrupt>
      <interrupt>
        <name>GPDMA1_CH3</name>
        <description>GPDMA1 channel 3 global interrupt</description>
        <value>32</value>
      </interrupt>
      <interrupt>
        <name>GPDMA1_CH4</name>
        <description>GPDMA1 channel 4 global interrupt</description>
        <value>33</value>
      </interrupt>
      <interrupt>
        <name>GPDMA1_CH5</name>
        <description>GPDMA1 channel 5 global interrupt</description>
        <value>34</value>
      </interrupt>
      <interrupt>
        <name>GPDMA1_CH6</name>
        <description>GPDMA1 channel 6 global interrupt</description>
        <value>35</value>
      </interrupt>
      <interrupt>
        <name>GPDMA1_CH7</name>
        <description>GPDMA1 channel 7 global interrupt</description>
        <value>36</value>
      </interrupt>
      <interrupt>
        <name>GPDMA1_CH8</name>
        <description>GPDMA1 channel 8 global interrupt</description>
        <value>80</value>
      </interrupt>
      <interrupt>
        <name>GPDMA1_CH9</name>
        <description>GPDMA1 channel 9 global interrupt</description>
        <value>81</value>
      </interrupt>
      <interrupt>
        <name>GPDMA1_CH10</name>
        <description>GPDMA1 channel 10 global interrupt</description>
        <value>82</value>
      </interrupt>
      <interrupt>
        <name>GPDMA1_CH11</name>
        <description>GPDMA1 channel 11 global interrupt</description>
        <value>83</value>
      </interrupt>
      <interrupt>
        <name>GPDMA1_CH12</name>
        <description>GPDMA1 channel 12 global interrupt</description>
        <value>84</value>
      </interrupt>
      <interrupt>
        <name>GPDMA1_CH13</name>
        <description>GPDMA1 channel 13 global interrupt</description>
        <value>85</value>
      </interrupt>
      <interrupt>
        <name>GPDMA1_CH14</name>
        <description>GPDMA1 channel 14 global interrupt</description>
        <value>86</value>
      </interrupt>
      <interrupt>
        <name>GPDMA1_CH15</name>
        <description>GPDMA1 channel 15 global interrupt</description>
        <value>87</value>
      </interrupt>
      <registers>
        <register>
          <name>SECCFGR</name>
          <displayName>SECCFGR</displayName>
          <description>GPDMA secure configuration register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <dim>16</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-15</dimIndex>
              <name>SEC%s</name>
              <description>SEC%s</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PRIVCFGR</name>
          <displayName>PRIVCFGR</displayName>
          <description>GPDMA privileged configuration register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <dim>16</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-15</dimIndex>
              <name>PRIV%s</name>
              <description>PRIV%s</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MISR</name>
          <displayName>MISR</displayName>
          <description>non-secure masked interrupt status register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <dim>16</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-15</dimIndex>
              <name>MIS%s</name>
              <description>MIS%s</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SMISR</name>
          <displayName>SMISR</displayName>
          <description>secure masked interrupt status register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <dim>16</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-15</dimIndex>
              <name>MIS%s</name>
              <description>MIS%s</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>12</dim>
          <dimIncrement>0x80</dimIncrement>
          <dimIndex>0-11</dimIndex>
          <name>CH%s</name>
          <description>Channel cluster</description>
          <addressOffset>0x50</addressOffset>
          <register>
            <name>LBAR</name>
            <displayName>C0LBAR</displayName>
            <description>channel x linked-list base address register</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>LBA</name>
                <description>linked-list base address of DMA channel x</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>FCR</name>
            <displayName>C0FCR</displayName>
            <description>GPDMA channel x flag clear register</description>
            <addressOffset>0xC</addressOffset>
            <size>0x20</size>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>TCF</name>
                <description>transfer complete flag clear - 0: no effect - 1: clears the corresponding TCF flag</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>HTF</name>
                <description>half transfer flag clear - 0: no effect - 1: clears the corresponding HTF flag</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>DTEF</name>
                <description>data transfer error flag clear - 0: no effect - 1: clears the corresponding DTEF flag</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>ULEF</name>
                <description>update link transfer error flag clear - 0: no effect - 1: clears the corresponding ULEF flag</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>USEF</name>
                <description>user setting error flag clear - 0: no effect - 1: clears the corresponding USEF flag</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>SUSPF</name>
                <description>completed suspension flag clear - 0: no effect - 1: clears the corresponding SUSPF flag</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>TOF</name>
                <description>trigger overrun flag clear</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>SR</name>
            <displayName>C0SR</displayName>
            <description>channel x status register</description>
            <addressOffset>0x10</addressOffset>
            <size>0x20</size>
            <access>read-only</access>
            <resetValue>0x00000001</resetValue>
            <fields>
              <field>
                <name>IDLEF</name>
                <description>idle flag - 0: the channel is not in idle state - 1: the channel is in idle state This idle flag is de-asserted by hardware when the channel is enabled (i.e. is written 1 into GPDMA_CxCR.EN) with a valid channel configuration (i.e. no USEF to be immediately reported). This idle flag is asserted after hard reset or by hardware when the channel is back in idle state (i.e. in suspended or disabled state).</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>TCF</name>
                <description>transfer complete flag - 0: no transfer complete event - 1: a transfer complete event occurred A transfer complete event is either a block transfer complete or a 2D/repeated block transfer complete, or a LLI transfer complete including the upload of the next LLI if any, or the full linked-list completion, depending on the transfer complete event mode i.e. GPDMA_CxTR2.TCEM[1:0].</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>HTF</name>
                <description>half transfer flag - 0: no half transfer event - 1: an half transfer event occurred An half transfer event is either an half block transfer or an half 2D/repeated block transfer, depending on the transfer complete event mode i.e. GPDMA_CxTR2.TCEM[1:0]. An half block transfer occurs when half of the bytes of the source block size (i.e. rounded up integer of GPDMA_CxBR1.BNDT[15:0]/2) has been transferred to the destination. Half 2D/repeated block transfer occurs when half of the repeated blocks (i.e. rounded up integer of (GPDMA_CxBR1.BRC[10:0]+1)/2) have been transferred to the destination.</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>DTEF</name>
                <description>data transfer error flag - 0: no data transfer error event - 1: a master bus error event occurred on a data transfer</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>ULEF</name>
                <description>update link transfer error flag - 0: no update link transfer error event - 1: a master bus error event occurred while updating a linked-list register from memory</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>USEF</name>
                <description>user setting error flag - 0: no user setting error event - 1: a user setting error event occurred</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>SUSPF</name>
                <description>completed suspension flag - 0: no completed suspension event - 1: a completed suspension event occurred</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>FIFOL</name>
                <description>monitored FIFO level Number of available write beats in the FIFO, in units of the programmed destination data width (c.f. GPDMA_CxTR1.DDW_LOG2[1:0], i.e. in units of bytes, half-words, or words). Note: After having suspended an active transfer, the user may need to read FIFOL[7:0], additionally to GPDMA_CxBR1.BDNT[15:0] and GPDMA_CxBR1.BRC[10:0] in order to know exactly how many data have been transferred to the destination. Before reading, the user may wait for the transfer to be indeed suspended i.e. GPDMA_CxSR.SUSPF=1.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
              </field>
            </fields>
          </register>
