knieriem/tinygo-stm32-svd/svd/stm32u595.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="PSSI">
      <name>SEC_PSSI</name>
      <baseAddress>0x5202C400</baseAddress>
    </peripheral>
    <peripheral>
      <name>PWR</name>
      <description>Power control</description>
      <groupName>PWR</groupName>
      <baseAddress>0x46020800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PWR_S3WU</name>
        <description>PWR wakeup from Stop 3 interrupt</description>
        <value>77</value>
      </interrupt>
      <registers>
        <register>
          <name>CR1</name>
          <displayName>CR1</displayName>
          <description>PWR control register 1</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPMS</name>
              <description>Low-power mode selection
These bits select the low-power mode entered when the CPU enters the Deepsleep mode.
10x: Standby mode (Standby mode also entered if LPMS = 11X in PWR_CR1
with BREN = 1 in PWR_BDCR1)
11x: Shutdown mode if BREN = 0 in PWR_BDCR1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>LPMS</name>
                <enumeratedValue>
                  <name>Stop0</name>
                  <description>Stop 0 mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Stop1</name>
                  <description>Stop 1 mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Stop2</name>
                  <description>Stop 2 mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Stop3</name>
                  <description>Stop 3 mode</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Standby</name>
                  <description>Standby mode (Standby mode also entered if LPMS = 11X in PWR_CR1 with BREN = 1 in PWR_BDCR1)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Shutdown</name>
                  <description>Shutdown mode if BREN = 0 in PWR_BDCR1</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RRSB1</name>
              <description>SRAM2 page 1 retention in Stop 3 and Standby modes
This bit is used to keep the SRAM2 page 1 content in Stop 3 and Standby modes. The SRAM2 page 1 corresponds to the first 8 Kbytes of the SRAM2
(from SRAM2 base address to SRAM2 base address + 0x1FFF).
Note: This bit has no effect in Shutdown mode.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>RRSB1</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>SRAM2 page1 content not retained in Stop3 and Standby modes</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>SRAM2 page1 content retained in Stop 3 and Standby modes</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RRSB2</name>
              <description>SRAM2 page 2 retention in Stop 3 and Standby modes
This bit is used to keep the SRAM2 page 2 content in Stop 3 and Standby modes. The SRAM2 page 2 corresponds to the last 56 Kbytes of the SRAM2
(from SRAM2 base address + 0x2000 to SRAM2 base address + 0xFFFF).
Note: This bit has no effect in Shutdown mode.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>RRSB2</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>SRAM2 page2 content not retained in Stop3 and Standby modes</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>SRAM2 page2 content retained in Stop 3 and Standby modes</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ULPMEN</name>
              <description>BOR ultra-low power mode
This bit is used to reduce the consumption by configuring the BOR in discontinuous mode.
This bit must be set to reach the lowest power consumption in the low-power modes.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>ULPMEN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>BOR level 0 operating in continuous (normal) mode in Standby mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>BOR level 0 operating in discontinuous (ultra-low power) mode in Standby mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM1PD</name>
              <description>SRAM1 power down
This bit is used to reduce the consumption by powering off the SRAM1.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>SRAM1PD</name>
                <enumeratedValue>
                  <name>On</name>
                  <description>SRAMx powered on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Off</name>
                  <description>SRAMx powered off</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM2PD</name>
              <description>SRAM2 power down
This bit is used to reduce the consumption by powering off the SRAM2.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SRAM1PD"/>
            </field>
            <field>
              <name>SRAM3PD</name>
              <description>SRAM3 power down
This bit is used to reduce the consumption by powering off the SRAM3.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SRAM1PD"/>
            </field>
            <field>
              <name>SRAM4PD</name>
              <description>SRAM4 power down
This bit is used to reduce the consumption by powering off the SRAM4.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SRAM1PD"/>
            </field>
            <field>
              <name>SRAM5PD</name>
              <description>SRAM5 power down
This bit is used to reduce the consumption by powering off the SRAM5.
Note: This bit is only available in STM32U59x/5Ax. It is reserved in STM32U575/585.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SRAM1PD"/>
            </field>
            <field>
              <name>FORCE_USBPWR</name>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>FORCE_USBPWR</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>OTG_HS PHY power is not maintained during low-power modes</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>OTG_HS PHY power is maintained during low-power modes</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <displayName>CR2</displayName>
          <description>PWR control register 2</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SRAM1PDS1</name>
              <description>SRAM1 page 1 (64 Kbytes) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>SRAM1PDS1</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>SRAM1 page x content retained in Stop modes</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>SRAM1 page x content lost in Stop modes</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM1PDS2</name>
              <description>SRAM1 page 2 (64 Kbytes) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SRAM1PDS1"/>
            </field>
            <field>
              <name>SRAM1PDS3</name>
              <description>SRAM1 page 3 (64 Kbytes) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SRAM1PDS1"/>
            </field>
            <field>
              <name>SRAM2PDS1</name>
              <description>SRAM2 page 1 (8 Kbytes) power-down in Stop modes (Stop 0, 1, 2)
Note: The SRAM2 page 1 retention in Stop 3 is controlled by RRSB1 bit in PWR_CR1.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>SRAM2PDS1</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>SRAM2 page x content retained in Stop modes</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>SRAM2 page x content lost in Stop modes</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM2PDS2</name>
              <description>SRAM2 page 2 (56 Kbytes) power-down in Stop modes (Stop 0, 1, 2)
Note: The SRAM2 page 2 retention in Stop 3 is controlled by RRSB2 bit in PWR_CR1.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SRAM2PDS1"/>
            </field>
            <field>
              <name>SRAM4PDS</name>
              <description>SRAM4 power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>SRAM4PDS</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>SRAM4 content retained in Stop modes</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>SRAM4 content lost in Stop modes</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ICRAMPDS</name>
              <description>ICACHE SRAM power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>ICRAMPDS</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>ICACHE SRAM content retained in Stop modes</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>ICACHE SRAM content lost in Stop modes</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DC1RAMPDS</name>
              <description>DCACHE1 SRAM power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>DC1RAMPDS</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>DCACHE1 SRAM content retained in Stop modes</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>DCACHE1 SRAM content lost in Stop modes</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA2DRAMPDS</name>
              <description>DMA2D SRAM power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>DMA2DRAMPDS</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>DMA2D SRAM content retained in Stop modes</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>DMA2D SRAM content lost in Stop modes</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRAMPDS</name>
              <description>FMAC, FDCAN and USB peripherals SRAM power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>PRAMPDS</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>FMAC, FDCAN, and USB/OTG_FS/OTG_HS SRAM content retained in Stop modes</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>FMAC, FDCAN, and USB/OTG_FS/OTG_HS SRAM content lost in Stop modes</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM4FWU</name>
              <description>SRAM4 fast wakeup from Stop 0, Stop 1 and Stop 2 modes
This bit is used to obtain the best trade-off between low-power consumption and wakeup time. SRAM4 wakeup time increases the wakeup time when exiting Stop 0, 1 and 2 modes, and also increases the LPDMA access time to SRAM4 during Stop modes.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>SRAM4FWU</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>SRAM4 enters low-power mode in Stop 0/1/2 modes (source biasing for lower-power consumption)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>SRAM4 remains in normal mode in Stop 0/1/2 modes (higher consumption but no SRAM4 wake-up time)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASHFWU</name>
              <description>Flash memory fast wakeup from Stop 0 and Stop 1 modes
This bit is used to obtain the best trade-off between low-power consumption and wakeup time when exiting the Stop 0 or Stop 1 modes.
When this bit is set, the Flash memory remains in normal mode in Stop 0 and Stop 1 modes, which offers a faster startup time with higher consumption.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>FLASHFWU</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Flash memory enters low-power mode in Stop 0/1 modes (lower-power consumption)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Flash memory remains in normal mode in Stop 0/1 modes (faster wake-up time)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM3PDS1</name>
              <description>SRAM3 page 1 (64 Kbytes) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>SRAM3PDS1</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>SRAM3 page x content retained in Stop modes</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>SRAM3 page x content lost in Stop modes</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM3PDS2</name>
              <description>SRAM3 page 2 (64 Kbytes) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SRAM3PDS1"/>
            </field>
            <field>
              <name>SRAM3PDS3</name>
              <description>SRAM3 page 3 (64 Kbytes) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SRAM3PDS1"/>
            </field>
            <field>
              <name>SRAM3PDS4</name>
              <description>SRAM3 page 4 (64 Kbytes) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SRAM3PDS1"/>
            </field>
            <field>
              <name>SRAM3PDS5</name>
              <description>SRAM3 page 5 (64 Kbytes) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SRAM3PDS1"/>
            </field>
            <field>
              <name>SRAM3PDS6</name>
              <description>SRAM3 page 6 (64 Kbytes) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SRAM3PDS1"/>
            </field>
            <field>
              <name>SRAM3PDS7</name>
              <description>SRAM3 page 7 (64 Kbytes) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SRAM3PDS1"/>
            </field>
            <field>
              <name>SRAM3PDS8</name>
              <description>SRAM3 page 8 (64 Kbytes) power-down in Stop modes (Stop 0, 1, 2, 3)</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SRAM3PDS1"/>
            </field>
            <field>
              <name>SRDRUN</name>
              <description>SmartRun domain in Run mode</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>SRDRUN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>SmartRun domain AHB3 and APB3 clocks disabled by default in Stop 0/1/2 modes</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>SmartRun domain AHB3 and APB3 clocks kept enabled in Stop 0/1/2 modes</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
