knieriem/tinygo-stm32-svd/svd/stm32u595.svd
        <register>
          <name>RX_ORDSETR</name>
          <displayName>RX_ORDSET</displayName>
          <description>UCPD Rx Ordered Set Register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RXORDSET</name>
              <description>RXORDSET</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>RXORDSET</name>
                <enumeratedValue>
                  <name>SOP</name>
                  <description>SOP code detected in receiver</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOPPrime</name>
                  <description>SOP' code detected in receiver</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOPDoublePrime</name>
                  <description>SOP'' code detected in receiver</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOPPrimeDebug</name>
                  <description>SOP'_Debug detected in receiver</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOPDoublePrimeDebug</name>
                  <description>SOP''_Debug detected in receiver</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CableReset</name>
                  <description>Cable Reset detected in receiver</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOPExtension1</name>
                  <description>SOP extension #1 detected in receiver</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOPExtension2</name>
                  <description>SOP extension #2 detected in receiver</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXSOP3OF4</name>
              <description>RXSOP3OF4</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>RXSOP3OF4</name>
                <enumeratedValue>
                  <name>AllCorrect</name>
                  <description>4 correct K-codes out of 4</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OneIncorrect</name>
                  <description>3 correct K-codes out of 4</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXSOPKINVALID</name>
              <description>RXSOPKINVALID</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>RXSOPKINVALID</name>
                <enumeratedValue>
                  <name>Valid</name>
                  <description>No K-code corrupted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FirstCorrupted</name>
                  <description>First K-code corrupted</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SecondCorrupted</name>
                  <description>Second K-code corrupted</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ThirdCorrupted</name>
                  <description>Third K-code corrupted</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FourthCorrupted</name>
                  <description>Fourth K-code corrupted</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_PAYSZR</name>
          <displayName>RX_PAYSZ</displayName>
          <description>UCPD Rx payload size Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RXPAYSZ</name>
              <description>RXPAYSZ</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1023</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RXDR</name>
          <displayName>RXDR</displayName>
          <description>UCPD Receive Data Register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RXDATA</name>
              <description>RXDATA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_ORDEXTR1</name>
          <displayName>RX_ORDEXT1</displayName>
          <description>UCPD Rx Ordered Set Extension
          Register 1</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RXSOPX1</name>
              <description>RXSOPX1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1048575</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_ORDEXTR2</name>
          <displayName>RX_ORDEXT2</displayName>
          <description>UCPD Rx Ordered Set Extension
          Register 2</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RXSOPX2</name>
              <description>RXSOPX2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1048575</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
